Tower-Monitoring-System/Tower_inclination_monitoring_system/Master_Src/Master/src/ESP32WiFiPortal/ESP32WiFiPortal.cpp
/**
 * @file ESP32WiFiPortal.cpp
 * @author Tran Nguyen Hien (trannguyenhien29085@gmail.com)
 * @brief ESP32 Wi-Fi captive portal library implementation
 * @version 2.1.1
 * @date 2026-09-10
 * 
 * @copyright Copyright (c) 2026 Tran Nguyen Hien. All rights reserved.
 */

#include "ESP32WiFiPortal.h"
#include "PortalPage.h"

#include <esp_wifi.h>
#include <new>

namespace {
void appendJsonEscaped(String& output, const String& value) {
  static const char kHex[] = "0123456789abcdef";
  for (size_t i = 0; i < value.length(); ++i) {
    const uint8_t character = static_cast<uint8_t>(value[i]);
    switch (character) {
      case '"': output += F("\\\""); break;
      case '\\': output += F("\\\\"); break;
      case '\b': output += F("\\b"); break;
      case '\f': output += F("\\f"); break;
      case '\n': output += F("\\n"); break;
      case '\r': output += F("\\r"); break;
      case '\t': output += F("\\t"); break;
      default:
        if (character < 0x20) {
          output += F("\\u00");
          output += kHex[character >> 4];
          output += kHex[character & 0x0F];
        } else {
          output += static_cast<char>(character);
        }
        break;
    }
  }
}

void appendIPAddress(String& output, const IPAddress& address) {
  for (uint8_t i = 0; i < 4; ++i) {
    if (i > 0) output += '.';
    output += static_cast<unsigned int>(address[i]);
  }
}

uint32_t hashSSID(const String& ssid) {
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < ssid.length(); ++i) {
    hash ^= static_cast<uint8_t>(ssid[i]);
    hash *= 16777619UL;
  }
  return hash;
}
}  // namespace

constexpr uint16_t ESP32WiFiPortal::kDnsPort;
constexpr uint16_t ESP32WiFiPortal::kHttpPort;
constexpr const char* ESP32WiFiPortal::kPrefsNamespace;
constexpr const char* ESP32WiFiPortal::kPrefsCredential;
constexpr const char* ESP32WiFiPortal::kPrefsSSID;
constexpr const char* ESP32WiFiPortal::kPrefsPassword;
constexpr uint32_t ESP32WiFiPortal::kCredentialMagic;
constexpr uint16_t ESP32WiFiPortal::kCredentialVersion;
constexpr size_t ESP32WiFiPortal::kCredentialSSIDCapacity;
constexpr size_t ESP32WiFiPortal::kCredentialPasswordCapacity;
constexpr size_t ESP32WiFiPortal::kCredentialSSIDOffset;
constexpr size_t ESP32WiFiPortal::kCredentialPasswordOffset;
constexpr size_t ESP32WiFiPortal::kCredentialCRCOffset;
constexpr size_t ESP32WiFiPortal::kCredentialRecordSize;
constexpr uint32_t ESP32WiFiPortal::kDefaultConnectTimeoutMs;

const char* ESP32WiFiPortal::portalNetworkValidationMessage(
    PortalNetworkValidationResult result) {
  switch (result) {
    case PortalNetworkValidationResult::InvalidLocalIP:
      return "Portal IP is not a usable unicast IPv4 address";
    case PortalNetworkValidationResult::InvalidGateway:
      return "Portal gateway is not a usable unicast IPv4 address";
    case PortalNetworkValidationResult::InvalidSubnetMask:
      return "Portal subnet mask is invalid or non-contiguous";
    case PortalNetworkValidationResult::UnsupportedSubnet:
      return "Portal subnet must be between /24 and /28 for SoftAP DHCP";
    case PortalNetworkValidationResult::DifferentSubnet:
      return "Portal IP and gateway must be in the same subnet";
    case PortalNetworkValidationResult::LocalIsNetworkAddress:
      return "Portal IP cannot be the subnet network address";
    case PortalNetworkValidationResult::LocalIsBroadcastAddress:
      return "Portal IP cannot be the subnet broadcast address";
    case PortalNetworkValidationResult::GatewayIsNetworkAddress:
      return "Portal gateway cannot be the subnet network address";
    case PortalNetworkValidationResult::GatewayIsBroadcastAddress:
      return "Portal gateway cannot be the subnet broadcast address";
    case PortalNetworkValidationResult::LocalConflictsWithDHCPLease:
      return "Portal IP conflicts with the SoftAP DHCP lease range";
    case PortalNetworkValidationResult::GatewayConflictsWithDHCPLease:
      return "Portal gateway conflicts with the SoftAP DHCP lease range";
    case PortalNetworkValidationResult::Valid:
      return "";
  }
  return "Portal IPv4 configuration is invalid";
}

ESP32WiFiPortal::ESP32WiFiPortal()
    : _portalIP(192, 168, 4, 1),
      _portalGateway(192, 168, 4, 1),
      _portalSubnet(255, 255, 255, 0) {}

ESP32WiFiPortal::~ESP32WiFiPortal() {
  const bool restoreCoreAutoReconnect = _wifiEventHandlerId != 0;
  if (_wifiEventHandlerId != 0) {
    WiFi.removeEvent(_wifiEventHandlerId);
    _wifiEventHandlerId = 0;
  }
  stopConfigPortal();
  cancelAutoReconnect(true);
  if (restoreCoreAutoReconnect) {
    WiFi.setAutoReconnect(_coreAutoReconnectWasEnabled);
  }
}

void ESP32WiFiPortal::ensureWiFiEventHandler() {
  if (_wifiEventHandlerId != 0) return;

  _coreAutoReconnectWasEnabled = WiFi.getAutoReconnect();
  _wifiEventHandlerId = WiFi.onEvent(
      [this](arduino_event_id_t event, arduino_event_info_t info) {
        switch (event) {
          case ARDUINO_EVENT_WIFI_STA_CONNECTED:
            _wifiEventBits.fetch_or(kEventSTAConnected);
            break;
          case ARDUINO_EVENT_WIFI_STA_GOT_IP:
            _wifiEventBits.fetch_or(kEventSTAGotIP);
            break;
          case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            _eventDisconnectReason.store(info.wifi_sta_disconnected.reason);
            _wifiEventBits.fetch_or(kEventSTADisconnected);
            break;
          default:
            break;
        }
      });

  if (_wifiEventHandlerId != 0) {
    // The library owns reconnect timing. Leaving the core policy enabled would
    // create a second, uncoordinated reconnect path from the event task.
    WiFi.setAutoReconnect(false);
  }
}

bool ESP32WiFiPortal::connectSaved(uint32_t timeoutMs) {
  ensureWiFiEventHandler();
  cancelAutoReconnect(true);
  if (_portalActive) {
    stopConfigPortal();
  }

  if (!ensureCredentialCache()) {
    if (_credentialCacheStatus == CredentialCacheStatus::Unavailable) {
      setError("Saved Wi-Fi credentials are temporarily unavailable");
      _state = State::Failed;
      scheduleAutoReconnect(_maxRetryIntervalMs);
    } else if (_credentialCacheStatus == CredentialCacheStatus::Corrupt) {
      setError("Saved Wi-Fi credential record is corrupt");
      _state = State::Failed;
    } else {
      setError("No saved Wi-Fi credentials");
      _state = State::Failed;
    }
    return false;
  }

