Tower-Monitoring-System/Tower_inclination_monitoring_system/Master_Src/Master/src/ESP32WiFiPortal/ESP32WiFiPortal.cpp
  const bool connected = connect(timeoutMs);
  if (!connected) scheduleSavedConnectionRecovery();
  return connected;
}

bool ESP32WiFiPortal::autoConnect(const char* apSSID,
                                  const char* apPassword,
                                  uint32_t connectTimeoutMs,
                                  uint32_t portalTimeoutMs) {
  if (connectSaved(connectTimeoutMs)) {
    return true;
  }
  return startConfigPortal(apSSID, apPassword, portalTimeoutMs);
}

bool ESP32WiFiPortal::startConfigPortal(const char* apSSID,
                                        const char* apPassword,
                                        uint32_t portalTimeoutMs) {
  if (!openPortal(apSSID, apPassword, portalTimeoutMs)) {
    return false;
  }

  while (_portalActive) {
    process();
    delay(2);
    yield();
  }

  return WiFi.status() == WL_CONNECTED;
}

bool ESP32WiFiPortal::startConfigPortalAsync(const char* apSSID,
                                             const char* apPassword,
                                             uint32_t portalTimeoutMs) {
  return openPortal(apSSID, apPassword, portalTimeoutMs);
}

bool ESP32WiFiPortal::openPortal(const char* apSSID,
                                 const char* apPassword,
                                 uint32_t portalTimeoutMs) {
  if (!apSSID || strlen(apSSID) == 0) {
    setError("AP SSID cannot be empty");
    return false;
  }
  if (!validAPPassword(apPassword)) {
    setError("AP password must be empty or 8-63 characters");
    return false;
  }

  const PortalNetworkValidationResult validation = validatePortalNetwork(
      ipv4ToUint32(_portalIP), ipv4ToUint32(_portalGateway),
      ipv4ToUint32(_portalSubnet));
  if (validation != PortalNetworkValidationResult::Valid) {
    setError(portalNetworkValidationMessage(validation));
    return false;
  }

  ensureWiFiEventHandler();
  // Load the last known-good credentials before a Portal candidate can use
  // the STA interface. They remain cached until a candidate is proven and
  // committed, or the application explicitly erases them.
  ensureCredentialCache();
  stopConfigPortal();
  cancelAutoReconnect(true);
  _lastError = "";
  _portalSSID = apSSID;
  _portalTimeoutMs = portalTimeoutMs;
  _portalStartedAt = millis();
  _connectPending = false;
  releaseSTAConnection();
  _portalRetriesUsed = 0;

  WiFi.mode(WIFI_AP_STA);
  if (!WiFi.softAPConfig(_portalIP, _portalGateway, _portalSubnet)) {
    return failPortalStart(
        "WiFi.softAPConfig() failed for the requested portal IP/subnet");
  }

  if (_hostname.length() > 0) {
    WiFi.setHostname(_hostname.c_str());
    WiFi.softAPsetHostname(_hostname.c_str());
  }

  bool apOk = false;
  if (apPassword && strlen(apPassword) > 0) {
    apOk = WiFi.softAP(apSSID, apPassword, _apChannel, _apHidden ? 1 : 0);
  } else {
    apOk = WiFi.softAP(apSSID, nullptr, _apChannel, _apHidden ? 1 : 0);
  }

  if (!apOk) {
    return failPortalStart("Failed to start ESP32 access point");
  }

  // softAPConfig() can fail incompletely on some core/IDF combinations. Read
  // back the active netif before DNS and HTTP bind to a different address.
  if (ipv4ToUint32(WiFi.softAPIP()) != ipv4ToUint32(_portalIP) ||
      ipv4ToUint32(WiFi.softAPSubnetMask()) != ipv4ToUint32(_portalSubnet)) {
    return failPortalStart(
        "SoftAP runtime IP/subnet does not match the portal configuration");
  }

  _redirectURL.remove(0);
  _redirectURL.reserve(24);
  _redirectURL += F("http://");
  appendIPAddress(_redirectURL, WiFi.softAPIP());
  _redirectURL += '/';

  _server.reset(new (std::nothrow) WebServer(kHttpPort));
  if (!_server) {
    return failPortalStart("Unable to allocate captive portal WebServer");
  }
  configureRoutes();
  _server->begin();

  _dns.setErrorReplyCode(DNSReplyCode::NoError);
  if (!_dns.start(kDnsPort, "*", WiFi.softAPIP())) {
    return failPortalStart("Failed to start captive portal DNS");
  }

  _portalActive = true;
  _state = State::Portal;
  if (_loggingEnabled) {
    Serial.print(F("[EWP] Portal started: http://"));
    Serial.println(_portalIP);
  }
  invoke(_onPortalStarted);
  return true;
}

bool ESP32WiFiPortal::failPortalStart(const char* message) {
  _portalActive = false;
  clearPendingConnection(true);

  if (_server) {
    _server->stop();
    _server.reset();
  }
  _dns.stop();
  resetScan(true);
  WiFi.softAPdisconnect(true);

  _portalTimeoutMs = 0;
  _portalStartedAt = 0;
  _responseBuffer = String();
  _scanSSID = String();
  _scanCompareSSID = String();
  _redirectURL = String();
  _scanNetworkIdentities.reset();
  _scanNetworkIdentityCapacity = 0;

  setError(message);
  _state = WiFi.status() == WL_CONNECTED ? State::Connected : State::Failed;
  scheduleSavedConnectionRecovery();
  return false;
}

void ESP32WiFiPortal::configureRoutes() {
  if (!_server) return;

  _server->on("/", HTTP_GET, [this]() { handleRoot(); });
  _server->on("/wifi", HTTP_GET, [this]() { handleRoot(); });
  _server->on("/scan", HTTP_GET, [this]() { handleScan(); });
  _server->on("/save", HTTP_POST, [this]() { handleSave(); });
  _server->on("/status", HTTP_GET, [this]() { handleStatus(); });

  // Common captive portal probes used by Android, Apple and Windows.
  _server->on("/generate_204", HTTP_ANY, [this]() { handleCaptiveProbe(); });
  _server->on("/gen_204", HTTP_ANY, [this]() { handleCaptiveProbe(); });
  _server->on("/hotspot-detect.html", HTTP_ANY, [this]() { handleCaptiveProbe(); });
  _server->on("/library/test/success.html", HTTP_ANY, [this]() { handleCaptiveProbe(); });
  _server->on("/connecttest.txt", HTTP_ANY, [this]() { handleCaptiveProbe(); });
  _server->on("/ncsi.txt", HTTP_ANY, [this]() { handleCaptiveProbe(); });
  _server->on("/fwlink", HTTP_ANY, [this]() { handleCaptiveProbe(); });

  _server->onNotFound([this]() { handleNotFound(); });
}

void ESP32WiFiPortal::handleRoot() {
  if (!_server) return;
  _server->send_P(200, "text/html; charset=utf-8", EWP_PORTAL_HTML);
}

void ESP32WiFiPortal::processScan() {
  if (_scanState != ScanState::Scanning) return;

  const int16_t result = WiFi.scanComplete();
  if (result == WIFI_SCAN_RUNNING &&
      millis() - _scanStartedAt < kScanTimeoutMs) {
    return;
  }

  if (result >= 0) {
    _scanResultCount = result;
    _scanState = ScanState::Ready;
    return;
  }

  // The Arduino core normally times out first. This explicit upper bound also
  // prevents an unusual driver state from leaving the Portal stuck polling.
  if (result == WIFI_SCAN_RUNNING) esp_wifi_scan_stop();
  WiFi.scanDelete();
  _scanResultCount = 0;
  _scanState = ScanState::Failed;
}

void ESP32WiFiPortal::resetScan(bool cancelActiveScan) {
  if (_scanState == ScanState::Idle) return;
  if (cancelActiveScan && _scanState == ScanState::Scanning) {
    esp_wifi_scan_stop();
  }
  WiFi.scanDelete();
  _scanState = ScanState::Idle;
  _scanStartedAt = 0;
  _scanResultCount = 0;
}

void ESP32WiFiPortal::handleScan() {
  if (!_server) return;

  if (_connectPending || _connectAttemptActive) {
    _server->sendHeader("Cache-Control", "no-store");
    _server->send(409, "application/json; charset=utf-8",
                  "{\"networks\":[],\"error\":\"Wi-Fi connection in progress\"}");
    return;
  }

  processScan();
  if (_scanState == ScanState::Idle) {
    const int16_t result = WiFi.scanNetworks(true, true);
    _scanStartedAt = millis();
    if (result == WIFI_SCAN_RUNNING) {
      _scanState = ScanState::Scanning;
    } else if (result >= 0) {
      _scanResultCount = result;
      _scanState = ScanState::Ready;
    } else {
      WiFi.scanDelete();
      _scanState = ScanState::Failed;
    }
  }

  if (_scanState == ScanState::Scanning) {
    _server->sendHeader("Cache-Control", "no-store");
    _server->sendHeader("Retry-After", "1");
    _server->send(202, "application/json; charset=utf-8",
                  "{\"scanning\":true}");
    return;
  }

  if (_scanState == ScanState::Failed) {
    _server->sendHeader("Cache-Control", "no-store");
    _server->send(503, "application/json; charset=utf-8",
                  "{\"networks\":[],\"error\":\"Wi-Fi scan failed\"}");
    resetScan(false);
    return;
  }

  const int count = _scanResultCount;

  if (static_cast<size_t>(count) > _scanNetworkIdentityCapacity) {
    std::unique_ptr<ScanNetworkIdentity[]> identities(
        new (std::nothrow) ScanNetworkIdentity[count]);
    if (identities) {
      _scanNetworkIdentities = std::move(identities);
      _scanNetworkIdentityCapacity = static_cast<size_t>(count);
    }
  }

  const bool hasIdentityBuffer =
      static_cast<size_t>(count) <= _scanNetworkIdentityCapacity;
  size_t uniqueCount = 0;
  bool wroteNetwork = false;

  _responseBuffer.remove(0);
  _responseBuffer.reserve(96 + static_cast<size_t>(count) * 80);
  _responseBuffer = F("{\"networks\":[");
  _scanSSID.reserve(32);
  _scanCompareSSID.reserve(32);

