Tower-Monitoring-System/Tower_inclination_monitoring_system/Master_Src/Master/src/ESP32WiFiPortal/ESP32WiFiPortal.cpp
  // Emit unique SSIDs only, strongest first (Arduino scan is normally RSSI sorted).
  for (int i = 0; i < count; ++i) {
    _scanSSID = WiFi.SSID(i);
    if (_scanSSID.length() == 0) continue;

    bool duplicate = false;
    if (hasIdentityBuffer) {
      const uint32_t hash = hashSSID(_scanSSID);
      for (size_t j = 0; j < uniqueCount; ++j) {
        if (_scanNetworkIdentities[j].hash != hash) continue;
        _scanCompareSSID = WiFi.SSID(_scanNetworkIdentities[j].index);
        if (_scanCompareSSID == _scanSSID) {
          duplicate = true;
          break;
        }
      }
      if (!duplicate) {
        _scanNetworkIdentities[uniqueCount].hash = hash;
        _scanNetworkIdentities[uniqueCount].index = i;
        ++uniqueCount;
      }
    } else {
      // Preserve exact duplicate filtering if the small temporary identity
      // buffer cannot be allocated.
      for (int j = 0; j < i; ++j) {
        _scanCompareSSID = WiFi.SSID(j);
        if (_scanCompareSSID == _scanSSID) {
          duplicate = true;
          break;
        }
      }
    }
    if (duplicate) continue;

    if (wroteNetwork) _responseBuffer += ',';
    wroteNetwork = true;

    const bool open = WiFi.encryptionType(i) == WIFI_AUTH_OPEN;
    _responseBuffer += F("{\"ssid\":\"");
    appendJsonEscaped(_responseBuffer, _scanSSID);
    _responseBuffer += F("\",\"rssi\":");
    _responseBuffer += WiFi.RSSI(i);
    _responseBuffer += F(",\"open\":");
    _responseBuffer += open ? F("true") : F("false");
    _responseBuffer += '}';
  }

  _responseBuffer += F("]}");
  resetScan(false);

  _server->sendHeader("Cache-Control", "no-store");
  _server->send(200, "application/json; charset=utf-8", _responseBuffer);
}

void ESP32WiFiPortal::handleSave() {
  if (!_server) return;

  if (_connectPending || _connectAttemptActive) {
    _server->send(409, "text/plain; charset=utf-8", "A Wi-Fi connection attempt is already running");
    return;
  }

  // Move request values directly into reusable candidate buffers instead of
  // creating another pair of short-lived credential Strings.
  _pendingSSID = _server->arg("ssid");
  _pendingPassword = _server->arg("password");

  if (!validSTACredentials(_pendingSSID, _pendingPassword)) {
    _pendingSSID.remove(0);
    _pendingPassword.remove(0);
    _server->send(400, "text/plain; charset=utf-8",
                  "SSID must be 1-32 bytes; password must be empty or 8-63 bytes");
    return;
  }

  // A valid connection request takes priority over a scan started by another
  // Portal client. The normal UI only submits after scan results are ready.
  resetScan(true);

  _connectPending = true;
  _connectPendingAt = millis();
  _connectPendingDelayMs = 350;
  _portalRetriesUsed = 0;
  _attemptTerminalFailure = false;
  _lastError = "";

  _server->send_P(200, "text/html; charset=utf-8", EWP_CONNECTING_HTML);
}

void ESP32WiFiPortal::handleStatus() {
  if (!_server) return;
  const bool candidateInProgress =
      _connectPending ||
      (_connectAttemptActive && _connectionOwner == ConnectionOwner::Portal);
  const bool connected = isConnected();
  _responseBuffer.remove(0);
  _responseBuffer.reserve(96 + _lastError.length());
  _responseBuffer = F("{\"connected\":");
  _responseBuffer += connected && !candidateInProgress ? F("true") : F("false");
  _responseBuffer += F(",\"portal\":");
  _responseBuffer += isPortalActive() ? F("true") : F("false");
  _responseBuffer += F(",\"ip\":\"");
  appendIPAddress(_responseBuffer,
                  connected ? WiFi.localIP() : WiFi.softAPIP());
  _responseBuffer += F("\",\"error\":\"");
  appendJsonEscaped(_responseBuffer, _lastError);
  _responseBuffer += F("\"}");
  _server->sendHeader("Cache-Control", "no-store");
  _server->send(200, "application/json; charset=utf-8", _responseBuffer);
}

void ESP32WiFiPortal::handleCaptiveProbe() {
  if (!_server) return;
  _server->sendHeader("Location", _redirectURL, true);
  _server->send(302, "text/plain", "");
}

void ESP32WiFiPortal::handleNotFound() {
  if (!_server) return;
  handleCaptiveProbe();
}

void ESP32WiFiPortal::process() {
  processWiFiEvents();

  if (_portalActive) {
    processScan();
    _dns.processNextRequest();
    if (_server) _server->handleClient();

    if (portalTimedOut()) {
      setError("Configuration portal timed out");
      log(F("[EWP] Portal timeout"));
      stopConfigPortal();
      if (WiFi.status() == WL_CONNECTED) {
        _state = State::Connected;
      } else if (_reconnectScheduled ||
                 (_connectAttemptActive &&
                  _connectionOwner == ConnectionOwner::Reconnect)) {
        _state = State::Connecting;
      } else {
        _state = State::Failed;
      }
      return;
    }

    if (_connectPending && !_connectAttemptActive &&
        millis() - _connectPendingAt >= _connectPendingDelayMs) {
      beginPendingConnection();
      return;
    }

    if (_connectAttemptActive && _connectionOwner == ConnectionOwner::Portal) {
      if (!advanceSTAConnection()) {
        clearPendingConnection(false);
        _state = State::Portal;
        return;
      }

      if (_connectionPhase != ConnectionPhase::Connecting) return;

      if (WiFi.status() == WL_CONNECTED) {
        if (!saveCredentials(_pendingSSID, _pendingPassword)) {
          clearPendingConnection(true);
          _state = State::Portal;
          setError("Connected, but unable to save Wi-Fi settings");
          return;
        }
        clearPendingConnection(false);
        _state = State::Connected;
        invoke(_onCredentialsSaved);
        invoke(_onConnected);
        stopConfigPortal();
        _state = State::Connected;
        return;
      }

      if (_attemptTerminalFailure) {
        failPendingConnection(true);
      } else if (millis() - _connectAttemptAt >= _connectTimeoutMs) {
        failPendingConnection(false);
      }
    }
  }

  processAutoReconnect();
}

void ESP32WiFiPortal::beginPendingConnection() {
  if (!_connectPending || _connectAttemptActive) return;

  _connectPending = false;
  _lastError = "";
  if (!beginSTAConnection(ConnectionOwner::Portal)) {
    clearPendingConnection(false);
    _state = State::Portal;
  }
}

void ESP32WiFiPortal::clearPendingConnection(bool disconnectSTA) {
  const bool ownsSTA = _connectionOwner == ConnectionOwner::Portal;
  if (disconnectSTA && ownsSTA && _connectAttemptActive) {
    cancelSTAConnection();
  } else if (ownsSTA) {
    releaseSTAConnection();
    _staDisconnected = WiFi.status() != WL_CONNECTED;
  }

  _connectPending = false;
  _connectPendingAt = 0;
  _connectPendingDelayMs = 350;
  _portalRetriesUsed = 0;
  // Keep these small buffers for the next Portal attempt to avoid repeatedly
  // allocating and freeing credential-sized heap blocks.
  _pendingSSID.remove(0);
  _pendingPassword.remove(0);
}

void ESP32WiFiPortal::failPendingConnection(bool terminalFailure) {
  cancelSTAConnection();

