Tower-Monitoring-System/Tower_inclination_monitoring_system/Master_Src/Master/src/ESP32WiFiPortal/ESP32WiFiPortal.cpp
  if (!terminalFailure && _portalRetriesUsed < _maxConnectionRetries) {
    ++_portalRetriesUsed;
    _connectPending = true;
    _connectPendingAt = millis();
    _connectPendingDelayMs = retryDelay(_portalRetriesUsed);
    _state = State::Portal;
    _lastError = "";
    if (_loggingEnabled) {
      Serial.print(F("[EWP] Retry "));
      Serial.print(_portalRetriesUsed);
      Serial.print('/');
      Serial.println(_maxConnectionRetries);
    }
    return;
  }

  clearPendingConnection(false);
  _state = State::Portal;
  setError(terminalFailure
               ? "Wi-Fi authentication failed. Check the password and try again."
               : "Unable to connect. Check the SSID/password and try again.");
}

bool ESP32WiFiPortal::beginSTAConnection(ConnectionOwner owner) {
  if (_connectAttemptActive || owner == ConnectionOwner::None) {
    setError("A Wi-Fi connection attempt is already running");
    return false;
  }

  ensureWiFiEventHandler();
  WiFi.setAutoReconnect(false);

  processWiFiEvents();
  WiFi.mode(_portalActive ? WIFI_AP_STA : WIFI_STA);
  if (_hostname.length() > 0) {
    WiFi.setHostname(_hostname.c_str());
    if (_portalActive) WiFi.softAPsetHostname(_hostname.c_str());
  }

  _connectionOwner = owner;
  _connectionPhase = ConnectionPhase::Settling;
  _connectAttemptActive = true;
  _connectAttemptAt = 0;
  _connectionPhaseAt = millis();
  _connectionSettleDelayMs = 0;
  _attemptTerminalFailure = false;

  // cancelSTAConnection() already leaves STA clean. Avoid a second disconnect
  // before the next retry, but remain conservative for the first attempt or a
  // currently connected interface.
  if (!_staDisconnected || WiFi.status() == WL_CONNECTED) {
    WiFi.disconnect(false, false);
    _staDisconnected = true;
    _connectionSettleDelayMs = kSTADisconnectSettleMs;
  }
  return true;
}

bool ESP32WiFiPortal::advanceSTAConnection() {
  if (!_connectAttemptActive) return false;
  if (_connectionPhase == ConnectionPhase::Connecting) return true;
  if (_connectionPhase != ConnectionPhase::Settling) return false;
  if (millis() - _connectionPhaseAt < _connectionSettleDelayMs) return true;

  if (!applySTAConfig()) {
    cancelSTAConnection();
    setError("Failed to apply STA IP/DNS configuration");
    return false;
  }

  const String* ssid = nullptr;
  const String* password = nullptr;
  if (_connectionOwner == ConnectionOwner::Portal) {
    ssid = &_pendingSSID;
    password = &_pendingPassword;
  } else if (_connectionOwner == ConnectionOwner::Blocking ||
             _connectionOwner == ConnectionOwner::Reconnect) {
    ssid = &_savedSSID;
    password = &_savedPassword;
  }
  if (!ssid || ssid->length() == 0 || !password) {
    cancelSTAConnection();
    setError("Wi-Fi credentials are unavailable");
    return false;
  }

  _connectionPhase = ConnectionPhase::Connecting;
  _connectAttemptAt = millis();
  _attemptTerminalFailure = false;
  log(F("[EWP] Connect"));

  _staDisconnected = false;
  const wl_status_t result = WiFi.begin(ssid->c_str(), password->c_str());
  if (result == WL_CONNECT_FAILED) {
    cancelSTAConnection();
    setError("Unable to start Wi-Fi connection");
    return false;
  }
  return true;
}

bool ESP32WiFiPortal::applySTAConfig() {
  if (_staStaticIPEnabled) {
    return WiFi.config(_staIP, _staGateway, _staSubnet,
                       _staPrimaryDNS, _staSecondaryDNS);
  }

  // A zero local address restarts DHCP in Arduino-ESP32. Applying it before
  // every managed attempt also cleanly exits a previous static configuration.
  return WiFi.config(IPAddress(), IPAddress(), IPAddress(),
                     IPAddress(), IPAddress());
}

void ESP32WiFiPortal::releaseSTAConnection() {
  _connectAttemptActive = false;
  _connectionOwner = ConnectionOwner::None;
  _connectionPhase = ConnectionPhase::Idle;
  _connectAttemptAt = 0;
  _connectionPhaseAt = 0;
  _connectionSettleDelayMs = 0;
  _attemptTerminalFailure = false;
}

void ESP32WiFiPortal::cancelSTAConnection() {
  const bool disconnectSTA =
      _connectAttemptActive &&
      _connectionPhase == ConnectionPhase::Connecting &&
      !_staDisconnected;
  releaseSTAConnection();
  if (disconnectSTA) {
    WiFi.disconnect(false, false);
    _staDisconnected = true;
  }
}

void ESP32WiFiPortal::processWiFiEvents() {
  const uint32_t events = _wifiEventBits.exchange(0);
  if (events == 0) return;

  const bool connectedNow = WiFi.status() == WL_CONNECTED;
  if ((events & kEventSTAConnected) != 0 && _loggingEnabled) {
    Serial.println(F("[EWP] STA connected"));
  }
  if ((events & kEventSTAConnected) != 0) _staDisconnected = false;

  if ((events & kEventSTAGotIP) != 0 && connectedNow) {
    _staDisconnected = false;
    if (_loggingEnabled) {
      Serial.print(F("[EWP] Got IP: "));
      Serial.println(WiFi.localIP());
    }
    if (_connectionOwner == ConnectionOwner::None && !_portalActive) {
      _reconnectScheduled = false;
      _reconnectRetriesUsed = 0;
      _state = State::Connected;
    }
  }

  if ((events & kEventSTADisconnected) == 0) return;

  uint8_t reason = static_cast<uint8_t>(_eventDisconnectReason.load());
  if (reason == 0) reason = WIFI_REASON_UNSPECIFIED;
  _lastDisconnectReason = reason;
  logDisconnect(reason);
  if (!_connectAttemptActive && !connectedNow) _staDisconnected = true;
  if (connectedNow || reason == WIFI_REASON_ASSOC_LEAVE) return;

  if (_connectAttemptActive) {
    // Saved credentials may see AUTH_FAIL during weak signal, AP overload, or
    // a router restart. Only an unproven Portal/initial blocking candidate is
    // allowed to treat a clear credential rejection as terminal. Reconnect
    // always remains recoverable through its bounded cooldown policy.
    if (_connectionPhase == ConnectionPhase::Connecting &&
        _connectionOwner != ConnectionOwner::Reconnect) {
      _attemptTerminalFailure =
          _attemptTerminalFailure || isCredentialFailureReason(reason);
    }
    return;
  }

  if (_autoReconnectEnabled && !_portalActive && _state == State::Connected) {
    _reconnectRetriesUsed = 0;
    scheduleAutoReconnect(_retryIntervalMs);
  }
}

