Tower-Monitoring-System/Tower_inclination_monitoring_system/Master_Src/Master/src/ESP32WiFiPortal/ESP32WiFiPortal.cpp
void ESP32WiFiPortal::processAutoReconnect() {
  if (!_autoReconnectEnabled || _portalActive) return;

  if (_connectAttemptActive && _connectionOwner == ConnectionOwner::Reconnect) {
    if (!advanceSTAConnection()) {
      scheduleNextAutoReconnect();
      return;
    }
    if (_connectionPhase != ConnectionPhase::Connecting) return;

    if (WiFi.status() == WL_CONNECTED) {
      releaseSTAConnection();
      _staDisconnected = false;
      _reconnectScheduled = false;
      _reconnectRetriesUsed = 0;
      _lastError = "";
      _state = State::Connected;
      invoke(_onConnected);
      return;
    }

    if (millis() - _connectAttemptAt < _connectTimeoutMs) {
      return;
    }

    cancelSTAConnection();
    scheduleNextAutoReconnect();
    return;
  }

  if (!_reconnectScheduled || _connectAttemptActive ||
      millis() - _reconnectScheduledAt < _reconnectDelayMs) {
    return;
  }

  if (WiFi.status() == WL_CONNECTED) {
    _reconnectScheduled = false;
    _reconnectRetriesUsed = 0;
    _staDisconnected = false;
    _state = State::Connected;
    return;
  }

  if (!ensureCredentialCache()) {
    if (_credentialCacheStatus != CredentialCacheStatus::Unavailable) {
      _reconnectScheduled = false;
      setError(_credentialCacheStatus == CredentialCacheStatus::Corrupt
                   ? "Auto reconnect rejected a corrupt credential record"
                   : "Auto reconnect requires saved Wi-Fi credentials");
      _state = State::Failed;
    } else {
      setError("Saved Wi-Fi credentials are temporarily unavailable");
      scheduleAutoReconnect(_maxRetryIntervalMs);
    }
    return;
  }

  _reconnectScheduled = false;
  if (_loggingEnabled) {
    if (_reconnectRetriesUsed == 0) {
      Serial.println(F("[EWP] Reconnect"));
    } else {
      Serial.print(F("[EWP] Retry "));
      Serial.print(_reconnectRetriesUsed);
      Serial.print('/');
      Serial.println(_maxConnectionRetries);
    }
  }

  _state = State::Connecting;
  if (!beginSTAConnection(ConnectionOwner::Reconnect)) {
    scheduleNextAutoReconnect();
  }
}

void ESP32WiFiPortal::scheduleAutoReconnect(uint32_t delayMs) {
  if (!_autoReconnectEnabled || _portalActive) return;
  _reconnectScheduled = true;
  _reconnectScheduledAt = millis();
  _reconnectDelayMs = delayMs;
  _state = State::Connecting;
}

void ESP32WiFiPortal::scheduleNextAutoReconnect() {
  if (_reconnectRetriesUsed < _maxConnectionRetries) {
    ++_reconnectRetriesUsed;
    scheduleAutoReconnect(retryDelay(_reconnectRetriesUsed));
    return;
  }

  _reconnectRetriesUsed = 0;
  scheduleAutoReconnect(_maxRetryIntervalMs);
  log(F("[EWP] Reconnect cooldown"));
}

bool ESP32WiFiPortal::scheduleSavedConnectionRecovery() {
  if (!_autoReconnectEnabled || _portalActive || _connectAttemptActive ||
      WiFi.status() == WL_CONNECTED) {
    return false;
  }

  const bool hasCredentials = ensureCredentialCache();
  if (!hasCredentials &&
      _credentialCacheStatus != CredentialCacheStatus::Unavailable) {
    return false;
  }

  _reconnectRetriesUsed = 0;
  scheduleAutoReconnect(hasCredentials ? _retryIntervalMs
                                       : _maxRetryIntervalMs);
  log(F("[EWP] Restoring saved Wi-Fi"));
  return true;
}

void ESP32WiFiPortal::cancelAutoReconnect(bool disconnectSTA) {
  _reconnectScheduled = false;
  _reconnectRetriesUsed = 0;
  _reconnectScheduledAt = 0;
  _reconnectDelayMs = 0;
  if (_connectionOwner == ConnectionOwner::Reconnect) {
    if (disconnectSTA) {
      cancelSTAConnection();
    } else {
      releaseSTAConnection();
      _staDisconnected = WiFi.status() != WL_CONNECTED;
    }
  }
}

uint32_t ESP32WiFiPortal::retryDelay(uint8_t retryNumber) const {
  uint32_t delayMs = _retryIntervalMs;
  for (uint8_t i = 1; i < retryNumber && delayMs < _maxRetryIntervalMs; ++i) {
    if (delayMs > _maxRetryIntervalMs / 2) {
      delayMs = _maxRetryIntervalMs;
    } else {
      delayMs *= 2;
    }
  }
  return delayMs > _maxRetryIntervalMs ? _maxRetryIntervalMs : delayMs;
}

bool ESP32WiFiPortal::connect(uint32_t timeoutMs) {
  if (_savedSSID.length() == 0) {
    setError("SSID cannot be empty");
    _state = State::Failed;
    return false;
  }

  if (_portalActive) {
    stopConfigPortal();
  }

  ensureWiFiEventHandler();
  cancelAutoReconnect(true);
  if (timeoutMs == 0) {
    timeoutMs = kDefaultConnectTimeoutMs;
    log(F("[EWP] Connect timeout 0 normalized to 15000 ms"));
  }
  _state = State::Connecting;
  _lastError = "";
  uint8_t retriesUsed = 0;

  while (true) {
    if (!beginSTAConnection(ConnectionOwner::Blocking)) {
      _state = State::Failed;
      return false;
    }

    bool setupFailed = false;
    while (true) {
      processWiFiEvents();
      if (!advanceSTAConnection()) {
        setupFailed = true;
        break;
      }
      if (_connectionPhase != ConnectionPhase::Connecting) {
        delay(1);
        yield();
        continue;
      }
      if (WiFi.status() == WL_CONNECTED) break;
      if (_attemptTerminalFailure ||
          millis() - _connectAttemptAt >= timeoutMs) {
        break;
      }
      delay(10);
      yield();
    }

    if (setupFailed) {
      _state = State::Failed;
      return false;
    }

    if (WiFi.status() == WL_CONNECTED) {
      releaseSTAConnection();
      _staDisconnected = false;
      _state = State::Connected;
      invoke(_onConnected);
      return true;
    }

    const bool terminalFailure = _attemptTerminalFailure;
    cancelSTAConnection();
    if (terminalFailure || retriesUsed >= _maxConnectionRetries) {
      setError(terminalFailure ? "Wi-Fi authentication failed"
                               : "Wi-Fi connection timed out");
      _state = State::Failed;
      return false;
    }

    ++retriesUsed;
    const uint32_t waitMs = retryDelay(retriesUsed);
    if (_loggingEnabled) {
      Serial.print(F("[EWP] Retry "));
      Serial.print(retriesUsed);
      Serial.print('/');
      Serial.println(_maxConnectionRetries);
    }
    const uint32_t waitStartedAt = millis();
    while (millis() - waitStartedAt < waitMs) {
      processWiFiEvents();
      delay(5);
      yield();
    }
  }
}

void ESP32WiFiPortal::stopConfigPortal() {
  const bool wasPortalActive = _portalActive;
  _portalActive = false;
  clearPendingConnection(true);

