Tower-Monitoring-System/Tower_inclination_monitoring_system/Master_Src/Master/src/ESP32WiFiPortal/ESP32WiFiPortal.cpp
  if (_server) {
    _server->stop();
    _server.reset();
  }
  _dns.stop();
  resetScan(true);

  if (wasPortalActive) {
    WiFi.softAPdisconnect(true);
    log(F("[EWP] Portal stopped"));
  }

  _portalTimeoutMs = 0;
  _portalStartedAt = 0;
  _responseBuffer = String();
  _scanSSID = String();
  _scanCompareSSID = String();
  _redirectURL = String();
  _scanNetworkIdentities.reset();
  _scanNetworkIdentityCapacity = 0;

  if (_state == State::Portal) {
    _state = WiFi.status() == WL_CONNECTED ? State::Connected : State::Idle;
  }

  if (wasPortalActive && WiFi.status() != WL_CONNECTED) {
    scheduleSavedConnectionRecovery();
  }
}

bool ESP32WiFiPortal::saveCredentials(const String& ssid, const String& password) {
  if (!validSTACredentials(ssid, password)) {
    setError("Invalid Wi-Fi credential length");
    return false;
  }

  Preferences prefs;
  if (!prefs.begin(kPrefsNamespace, false)) {
    setError("Unable to open NVS namespace");
    return false;
  }

  const bool saved = writeCredentialRecord(prefs, ssid, password);
  if (saved) {
    // Legacy keys are kept until the new record has survived an exact
    // read-back and CRC validation. A reset at any earlier point can safely
    // retry migration from the complete legacy pair.
    if (prefs.isKey(kPrefsSSID)) prefs.remove(kPrefsSSID);
    if (prefs.isKey(kPrefsPassword)) prefs.remove(kPrefsPassword);
  }
  prefs.end();

  if (saved) {
    _savedSSID = ssid;
    _savedPassword = password;
    _credentialCacheStatus = CredentialCacheStatus::Valid;
  }
  return saved;
}

bool ESP32WiFiPortal::ensureCredentialCache() {
  if (_credentialCacheStatus == CredentialCacheStatus::Valid) return true;
  if (_credentialCacheStatus == CredentialCacheStatus::NotFound ||
      _credentialCacheStatus == CredentialCacheStatus::Corrupt) {
    return false;
  }

  Preferences prefs;
  // Read-write mode lets Preferences open a fresh namespace, so an empty
  // device is distinguishable from an NVS-open failure. This path runs only
  // while the object cache is unresolved, not on every reconnect attempt.
  if (!prefs.begin(kPrefsNamespace, false)) {
    clearCredentialCache(CredentialCacheStatus::Unavailable);
    return false;
  }

  String ssid;
  String password;
  const CredentialCacheStatus blobStatus =
      readCredentialBlob(prefs, ssid, password);
  const bool staleLegacyKeys =
      prefs.isKey(kPrefsSSID) || prefs.isKey(kPrefsPassword);
  if (blobStatus == CredentialCacheStatus::Valid) {
    // Complete cleanup if power was lost after a verified migration write.
    if (staleLegacyKeys) {
      if (prefs.isKey(kPrefsSSID)) prefs.remove(kPrefsSSID);
      if (prefs.isKey(kPrefsPassword)) prefs.remove(kPrefsPassword);
    }
    prefs.end();
    _savedSSID = std::move(ssid);
    _savedPassword = std::move(password);
    _credentialCacheStatus = CredentialCacheStatus::Valid;
    return true;
  }

  // A valid legacy pair is also the recovery point for an interrupted first
  // blob write. A corrupt blob without a complete legacy pair is never used.
  const CredentialCacheStatus legacyStatus =
      readLegacyCredentials(prefs, ssid, password);

  if (legacyStatus == CredentialCacheStatus::Valid) {
    const bool migrated = writeCredentialRecord(prefs, ssid, password);
    if (migrated) {
      if (prefs.isKey(kPrefsSSID)) prefs.remove(kPrefsSSID);
      if (prefs.isKey(kPrefsPassword)) prefs.remove(kPrefsPassword);
    }
    prefs.end();
    if (!migrated) {
      clearCredentialCache(CredentialCacheStatus::Unavailable);
      return false;
    }

    _savedSSID = std::move(ssid);
    _savedPassword = std::move(password);
    _credentialCacheStatus = CredentialCacheStatus::Valid;
    return true;
  }

  prefs.end();
  clearCredentialCache(
      blobStatus == CredentialCacheStatus::Corrupt ||
              legacyStatus == CredentialCacheStatus::Corrupt
          ? CredentialCacheStatus::Corrupt
          : CredentialCacheStatus::NotFound);
  return false;
}

bool ESP32WiFiPortal::validSTACredentials(const String& ssid,
                                          const String& password) {
  const size_t ssidLength = ssid.length();
  const size_t passwordLength = password.length();
  if (ssidLength == 0 || ssidLength > 32 || passwordLength > 63 ||
      (passwordLength > 0 && passwordLength < 8)) {
    return false;
  }

  // WiFi.begin() consumes C strings, so embedded NUL bytes cannot be stored as
  // part of an exact credential value.
  for (size_t i = 0; i < ssidLength; ++i) {
    if (ssid[i] == '\0') return false;
  }
  for (size_t i = 0; i < passwordLength; ++i) {
    if (password[i] == '\0') return false;
  }
  return true;
}

uint32_t ESP32WiFiPortal::credentialCRC32(const uint8_t* data,
                                          size_t length) {
  uint32_t crc = 0xFFFFFFFFUL;
  for (size_t i = 0; i < length; ++i) {
    crc ^= data[i];
    for (uint8_t bit = 0; bit < 8; ++bit) {
      crc = (crc >> 1) ^ ((crc & 1U) ? 0xEDB88320UL : 0UL);
    }
  }
  return crc ^ 0xFFFFFFFFUL;
}

bool ESP32WiFiPortal::serializeCredentialRecord(const String& ssid,
                                                const String& password,
                                                uint8_t* record,
                                                size_t recordSize) {
  if (!record || recordSize != kCredentialRecordSize ||
      !validSTACredentials(ssid, password)) {
    return false;
  }

  memset(record, 0, recordSize);
  record[0] = static_cast<uint8_t>(kCredentialMagic);
  record[1] = static_cast<uint8_t>(kCredentialMagic >> 8);
  record[2] = static_cast<uint8_t>(kCredentialMagic >> 16);
  record[3] = static_cast<uint8_t>(kCredentialMagic >> 24);
  record[4] = static_cast<uint8_t>(kCredentialVersion);
  record[5] = static_cast<uint8_t>(kCredentialVersion >> 8);
  record[6] = static_cast<uint8_t>(kCredentialRecordSize);
  record[7] = static_cast<uint8_t>(kCredentialRecordSize >> 8);
  record[8] = static_cast<uint8_t>(ssid.length());
  record[9] = static_cast<uint8_t>(password.length());
  memcpy(record + kCredentialSSIDOffset, ssid.c_str(), ssid.length());
  memcpy(record + kCredentialPasswordOffset, password.c_str(),
         password.length());

  const uint32_t crc = credentialCRC32(record, kCredentialCRCOffset);
  record[kCredentialCRCOffset] = static_cast<uint8_t>(crc);
  record[kCredentialCRCOffset + 1] = static_cast<uint8_t>(crc >> 8);
  record[kCredentialCRCOffset + 2] = static_cast<uint8_t>(crc >> 16);
  record[kCredentialCRCOffset + 3] = static_cast<uint8_t>(crc >> 24);
  return true;
}

bool ESP32WiFiPortal::deserializeCredentialRecord(const uint8_t* record,
                                                  size_t recordSize,
                                                  String& ssid,
                                                  String& password) {
  if (!record || recordSize != kCredentialRecordSize) return false;

  const uint32_t magic = static_cast<uint32_t>(record[0]) |
                         (static_cast<uint32_t>(record[1]) << 8) |
                         (static_cast<uint32_t>(record[2]) << 16) |
                         (static_cast<uint32_t>(record[3]) << 24);
  const uint16_t version = static_cast<uint16_t>(record[4]) |
                           (static_cast<uint16_t>(record[5]) << 8);
  const uint16_t encodedSize = static_cast<uint16_t>(record[6]) |
                               (static_cast<uint16_t>(record[7]) << 8);
  const uint32_t storedCRC =
      static_cast<uint32_t>(record[kCredentialCRCOffset]) |
      (static_cast<uint32_t>(record[kCredentialCRCOffset + 1]) << 8) |
      (static_cast<uint32_t>(record[kCredentialCRCOffset + 2]) << 16) |
      (static_cast<uint32_t>(record[kCredentialCRCOffset + 3]) << 24);
  if (magic != kCredentialMagic || version != kCredentialVersion ||
      encodedSize != kCredentialRecordSize ||
      storedCRC != credentialCRC32(record, kCredentialCRCOffset)) {
    return false;
  }

  const size_t ssidLength = record[8];
  const size_t passwordLength = record[9];
  if (ssidLength == 0 || ssidLength > 32 || passwordLength > 63 ||
      (passwordLength > 0 && passwordLength < 8)) {
    return false;
  }

  for (size_t i = 0; i < kCredentialSSIDCapacity; ++i) {
    if ((i < ssidLength && record[kCredentialSSIDOffset + i] == 0) ||
        (i >= ssidLength && record[kCredentialSSIDOffset + i] != 0)) {
      return false;
    }
  }
  for (size_t i = 0; i < kCredentialPasswordCapacity; ++i) {
    if ((i < passwordLength && record[kCredentialPasswordOffset + i] == 0) ||
        (i >= passwordLength &&
         record[kCredentialPasswordOffset + i] != 0)) {
      return false;
    }
  }

  char ssidBuffer[kCredentialSSIDCapacity];
  char passwordBuffer[kCredentialPasswordCapacity];
  memset(ssidBuffer, 0, sizeof(ssidBuffer));
  memset(passwordBuffer, 0, sizeof(passwordBuffer));
  memcpy(ssidBuffer, record + kCredentialSSIDOffset, ssidLength);
  memcpy(passwordBuffer, record + kCredentialPasswordOffset, passwordLength);
  ssid = ssidBuffer;
  password = passwordBuffer;
  secureClear(ssidBuffer, sizeof(ssidBuffer));
  secureClear(passwordBuffer, sizeof(passwordBuffer));
  return validSTACredentials(ssid, password);
}

