Tower-Monitoring-System/Tower_inclination_monitoring_system/Master_Src/Master/src/ESP32WiFiPortal/ESP32WiFiPortal.cpp
void ESP32WiFiPortal::secureClear(void* data, size_t length) {
  volatile uint8_t* bytes = static_cast<volatile uint8_t*>(data);
  while (length-- > 0) *bytes++ = 0;
}

ESP32WiFiPortal::CredentialCacheStatus ESP32WiFiPortal::readCredentialBlob(
    Preferences& prefs,
    String& ssid,
    String& password) {
  if (!prefs.isKey(kPrefsCredential)) {
    return CredentialCacheStatus::NotFound;
  }
  if (prefs.getBytesLength(kPrefsCredential) != kCredentialRecordSize) {
    return CredentialCacheStatus::Corrupt;
  }

  uint8_t record[kCredentialRecordSize];
  const size_t bytesRead =
      prefs.getBytes(kPrefsCredential, record, sizeof(record));
  const bool valid = bytesRead == sizeof(record) &&
                     deserializeCredentialRecord(record, sizeof(record),
                                                 ssid, password);
  secureClear(record, sizeof(record));
  return valid ? CredentialCacheStatus::Valid
               : CredentialCacheStatus::Corrupt;
}

ESP32WiFiPortal::CredentialCacheStatus ESP32WiFiPortal::readLegacyCredentials(
    Preferences& prefs,
    String& ssid,
    String& password) {
  const bool hasSSID = prefs.isKey(kPrefsSSID);
  const bool hasPassword = prefs.isKey(kPrefsPassword);
  if (!hasSSID && !hasPassword) return CredentialCacheStatus::NotFound;
  if (!hasSSID || !hasPassword) return CredentialCacheStatus::Corrupt;

  ssid = prefs.getString(kPrefsSSID, "");
  password = prefs.getString(kPrefsPassword, "");
  return validSTACredentials(ssid, password)
             ? CredentialCacheStatus::Valid
             : CredentialCacheStatus::Corrupt;
}

bool ESP32WiFiPortal::writeCredentialRecord(Preferences& prefs,
                                            const String& ssid,
                                            const String& password) {
  uint8_t record[kCredentialRecordSize];
  uint8_t readBack[kCredentialRecordSize];
  if (!serializeCredentialRecord(ssid, password, record, sizeof(record))) {
    secureClear(record, sizeof(record));
    secureClear(readBack, sizeof(readBack));
    return false;
  }

  const size_t bytesWritten =
      prefs.putBytes(kPrefsCredential, record, sizeof(record));
  bool valid = bytesWritten == sizeof(record) &&
               prefs.getBytesLength(kPrefsCredential) == sizeof(record);
  String verifiedSSID;
  String verifiedPassword;
  if (valid) {
    const size_t bytesRead =
        prefs.getBytes(kPrefsCredential, readBack, sizeof(readBack));
    valid = bytesRead == sizeof(readBack) &&
            deserializeCredentialRecord(readBack, sizeof(readBack),
                                        verifiedSSID, verifiedPassword) &&
            verifiedSSID == ssid && verifiedPassword == password;
  }

  secureClear(record, sizeof(record));
  secureClear(readBack, sizeof(readBack));
  return valid;
}

void ESP32WiFiPortal::clearCredentialCache(CredentialCacheStatus status) {
  _savedSSID.remove(0);
  _savedPassword.remove(0);
  _credentialCacheStatus = status;
}

bool ESP32WiFiPortal::hasSavedCredentials() {
  return ensureCredentialCache();
}

String ESP32WiFiPortal::savedSSID() {
  return ensureCredentialCache() ? _savedSSID : String();
}

bool ESP32WiFiPortal::eraseCredentials(bool disconnect) {
  Preferences prefs;
  if (!prefs.begin(kPrefsNamespace, false)) {
    setError("Unable to open NVS namespace");
    return false;
  }
  bool ok = true;
  if (prefs.isKey(kPrefsCredential)) ok = prefs.remove(kPrefsCredential) && ok;
  if (prefs.isKey(kPrefsSSID)) ok = prefs.remove(kPrefsSSID) && ok;
  if (prefs.isKey(kPrefsPassword)) ok = prefs.remove(kPrefsPassword) && ok;
  prefs.end();

  if (ok) {
    clearCredentialCache(CredentialCacheStatus::NotFound);
  } else {
    clearCredentialCache(CredentialCacheStatus::Unknown);
  }

  if (disconnect) {
    cancelAutoReconnect(true);
    stopConfigPortal();
    WiFi.disconnect(true, true);
    _state = State::Idle;
  }
  return ok;
}

bool ESP32WiFiPortal::setPortalIP(const IPAddress& localIP) {
  return setPortalIP(localIP, localIP, IPAddress(255, 255, 255, 0));
}

bool ESP32WiFiPortal::setPortalIP(const IPAddress& localIP,
                                  const IPAddress& gateway,
                                  const IPAddress& subnet) {
  if (_portalActive) {
    setError("Portal IP cannot be changed while the portal is active");
    return false;
  }
  const PortalNetworkValidationResult validation = validatePortalNetwork(
      ipv4ToUint32(localIP), ipv4ToUint32(gateway), ipv4ToUint32(subnet));
  if (validation != PortalNetworkValidationResult::Valid) {
    setError(portalNetworkValidationMessage(validation));
    return false;
  }

  _portalIP = localIP;
  _portalGateway = gateway;
  _portalSubnet = subnet;
  _lastError = "";
  return true;
}

bool ESP32WiFiPortal::setSTAStaticIP(const IPAddress& localIP,
                                     const IPAddress& gateway,
                                     const IPAddress& subnet,
                                     const IPAddress& primaryDNS,
                                     const IPAddress& secondaryDNS) {
  if (_connectPending || _connectAttemptActive) {
    setError("STA IP cannot be changed during a connection attempt");
    return false;
  }
  const uint32_t local = ipv4ToUint32(localIP);
  const uint32_t gatewayValue = ipv4ToUint32(gateway);
  const uint32_t primaryDNSValue = ipv4ToUint32(primaryDNS);
  const uint32_t secondaryDNSValue = ipv4ToUint32(secondaryDNS);
  if (!isValidSTANetwork(local, gatewayValue, ipv4ToUint32(subnet)) ||
      local == gatewayValue || !isValidDNSAddress(primaryDNSValue) ||
      !isValidDNSAddress(secondaryDNSValue) ||
      (primaryDNSValue == 0 && secondaryDNSValue != 0)) {
    setError("STA IP, gateway, subnet, or DNS configuration is invalid");
    return false;
  }

  _staIP = localIP;
  _staGateway = gateway;
  _staSubnet = subnet;
  _staPrimaryDNS = primaryDNS;
  _staSecondaryDNS = secondaryDNS;
  _staStaticIPEnabled = true;
  _lastError = "";
  return true;
}

void ESP32WiFiPortal::useSTADHCP() {
  _staStaticIPEnabled = false;
  _staIP = IPAddress();
  _staGateway = IPAddress();
  _staSubnet = IPAddress();
  _staPrimaryDNS = IPAddress();
  _staSecondaryDNS = IPAddress();
  _lastError = "";
}

