Tower-Monitoring-System/Tower_inclination_monitoring_system/Master_Src/Master/src/ESP32WiFiPortal/ESP32WiFiPortal.cpp
bool ESP32WiFiPortal::isSTAStaticIPConfigured() const {
  return _staStaticIPEnabled;
}

void ESP32WiFiPortal::setAutoReconnect(bool enabled) {
  ensureWiFiEventHandler();
  WiFi.setAutoReconnect(false);
  _autoReconnectEnabled = enabled;

  if (!enabled) {
    const bool hadActiveReconnect =
        _connectionOwner == ConnectionOwner::Reconnect;
    const bool wasReconnecting =
        _reconnectScheduled || hadActiveReconnect;
    cancelAutoReconnect(true);
    if (wasReconnecting) {
      _state = !hadActiveReconnect && WiFi.status() == WL_CONNECTED
                   ? State::Connected
                   : State::Idle;
    }
    return;
  }

  if (!_portalActive && !_connectAttemptActive &&
      WiFi.status() != WL_CONNECTED) {
    _reconnectRetriesUsed = 0;
    scheduleAutoReconnect(_retryIntervalMs);
  }
}

bool ESP32WiFiPortal::autoReconnectEnabled() const {
  return _autoReconnectEnabled;
}

bool ESP32WiFiPortal::setConnectionRetryPolicy(
    uint8_t retryCount,
    uint32_t retryIntervalMs,
    uint32_t maxRetryIntervalMs) {
  if (retryIntervalMs < 250 || maxRetryIntervalMs < 1000 ||
      maxRetryIntervalMs < retryIntervalMs) {
    setError("Retry interval must be >= 250 ms and maximum >= 1000 ms");
    return false;
  }

  _maxConnectionRetries = retryCount;
  _retryIntervalMs = retryIntervalMs;
  _maxRetryIntervalMs = maxRetryIntervalMs;
  _lastError = "";
  return true;
}

void ESP32WiFiPortal::setHostname(const char* hostname) {
  _hostname = hostname ? hostname : "";
}

void ESP32WiFiPortal::setConnectTimeout(uint32_t timeoutMs) {
  if (timeoutMs == 0) {
    _connectTimeoutMs = kDefaultConnectTimeoutMs;
    log(F("[EWP] Connect timeout 0 normalized to 15000 ms"));
    return;
  }
  _connectTimeoutMs = timeoutMs;
}

void ESP32WiFiPortal::setAPChannel(uint8_t channel) {
  if (channel >= 1 && channel <= 13) _apChannel = channel;
}

void ESP32WiFiPortal::setAPHidden(bool hidden) {
  _apHidden = hidden;
}

void ESP32WiFiPortal::setLogging(bool enabled) {
  _loggingEnabled = enabled;
}

void ESP32WiFiPortal::onPortalStarted(Callback callback) {
  _onPortalStarted = std::move(callback);
}

void ESP32WiFiPortal::onCredentialsSaved(Callback callback) {
  _onCredentialsSaved = std::move(callback);
}

void ESP32WiFiPortal::onConnected(Callback callback) {
  _onConnected = std::move(callback);
}

bool ESP32WiFiPortal::isPortalActive() const {
  return _portalActive;
}

bool ESP32WiFiPortal::isPortalConnectionAttemptActive() const {
  return _portalActive &&
         (_connectPending ||
          (_connectAttemptActive &&
           _connectionOwner == ConnectionOwner::Portal));
}

bool ESP32WiFiPortal::isConnected() const {
  return WiFi.status() == WL_CONNECTED;
}

ESP32WiFiPortal::State ESP32WiFiPortal::state() const {
  return _state;
}

IPAddress ESP32WiFiPortal::portalIP() const {
  return _portalIP;
}

String ESP32WiFiPortal::portalSSID() const {
  return _portalSSID;
}

String ESP32WiFiPortal::lastError() const {
  return _lastError;
}

uint8_t ESP32WiFiPortal::lastDisconnectReason() const {
  return _lastDisconnectReason;
}

bool ESP32WiFiPortal::validAPPassword(const char* password) const {
  if (!password || strlen(password) == 0) return true;
  const size_t len = strlen(password);
  return len >= 8 && len <= 63;
}

bool ESP32WiFiPortal::portalTimedOut() const {
  return _portalTimeoutMs > 0 && (millis() - _portalStartedAt >= _portalTimeoutMs);
}

bool ESP32WiFiPortal::isCredentialFailureReason(uint8_t reason) const {
  switch (reason) {
    case WIFI_REASON_AUTH_FAIL:
    case WIFI_REASON_802_1X_AUTH_FAILED:
      return true;
    default:
      return false;
  }
}

void ESP32WiFiPortal::setError(const String& message) {
  _lastError = message;
}

void ESP32WiFiPortal::invoke(const Callback& callback) {
  if (callback) callback();
}

void ESP32WiFiPortal::log(const __FlashStringHelper* message) const {
  if (_loggingEnabled) Serial.println(message);
}

void ESP32WiFiPortal::logDisconnect(uint8_t reason) const {
  if (!_loggingEnabled) return;
  Serial.print(F("[EWP] Disconnect: "));
  Serial.print(reason);
  const char* reasonName =
      WiFi.disconnectReasonName(static_cast<wifi_err_reason_t>(reason));
  if (reasonName && reasonName[0] != '\0') {
    Serial.print(F(" ("));
    Serial.print(reasonName);
    Serial.print(')');
  }
  Serial.println();
}
